In [1]:
import pandas as pd
import numpy as np

In [2]:
confirm = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
recover = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv')
death = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv')

In [3]:
confirm.to_csv('confirm.csv', index=False)
recover.to_csv('recover.csv', index=False)
death.to_csv('death.csv', index=False)

In [4]:
confirm.shape

(266, 123)

In [5]:
recover.shape

(253, 123)

In [6]:
death.shape

(266, 123)

In [7]:
confirm.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,5/10/20,5/11/20,5/12/20,5/13/20,5/14/20,5/15/20,5/16/20,5/17/20,5/18/20,5/19/20
0,NaN,Afghanistan,33.0000,65.0000,0,0,0,0,0,0,...,4402,4687,4963,5226,5639,6053,6402,6664,7072,7653
1,NaN,Albania,41.1533,20.1683,0,0,0,0,0,0,...,868,872,876,880,898,916,933,946,948,949
2,NaN,Algeria,28.0339,1.6596,0,0,0,0,0,0,...,5723,5891,6067,6253,6442,6629,6821,7019,7201,7377
3,NaN,Andorra,42.5063,1.5218,0,0,0,0,0,0,...,755,755,758,760,761,761,761,761,761,761
4,NaN,Angola,-11.2027,17.8739,0,0,0,0,0,0,...,45,45,45,45,48,48,48,48,50,52

In [8]:
# confirm.fillna("", inplace=True)
# recover.fillna("", inplace=True)
# death.fillna("", inplace=True)

In [9]:
temp = confirm.iloc[:,:4]
temp['confirm'] = confirm.iloc[:,-1]
confirm = temp

In [10]:
confirm.head()

  Province/State Country/Region      Lat     Long  confirm
0            NaN    Afghanistan  33.0000  65.0000     7653
1            NaN        Albania  41.1533  20.1683      949
2            NaN        Algeria  28.0339   1.6596     7377
3            NaN        Andorra  42.5063   1.5218      761
4            NaN         Angola -11.2027  17.8739       52

In [11]:
temp = recover.iloc[:,:4]
temp['recover'] = recover.iloc[:,-1]
recover = temp

In [12]:
recover.head()

  Province/State Country/Region      Lat     Long  recover
0            NaN    Afghanistan  33.0000  65.0000      850
1            NaN        Albania  41.1533  20.1683      742
2            NaN        Algeria  28.0339   1.6596     3746
3            NaN        Andorra  42.5063   1.5218      628
4            NaN         Angola -11.2027  17.8739       17

In [13]:
temp = death.iloc[:,:4]
temp['death'] = death.iloc[:,-1]
death = temp

In [14]:
death.head()

  Province/State Country/Region      Lat     Long  death
0            NaN    Afghanistan  33.0000  65.0000    178
1            NaN        Albania  41.1533  20.1683     31
2            NaN        Algeria  28.0339   1.6596    561
3            NaN        Andorra  42.5063   1.5218     51
4            NaN         Angola -11.2027  17.8739      3

In [15]:
data = confirm.merge(recover, sort=False, on=['Province/State','Country/Region','Lat','Long'], how='left')

In [16]:
data.shape

(266, 6)

In [17]:
data.head()

  Province/State Country/Region      Lat     Long  confirm  recover
0            NaN    Afghanistan  33.0000  65.0000     7653    850.0
1            NaN        Albania  41.1533  20.1683      949    742.0
2            NaN        Algeria  28.0339   1.6596     7377   3746.0
3            NaN        Andorra  42.5063   1.5218      761    628.0
4            NaN         Angola -11.2027  17.8739       52     17.0

In [18]:
data = data.merge(death, sort=False, on=['Province/State','Country/Region','Lat','Long'], how='left')

In [19]:
data.shape

(266, 7)

In [20]:
data.head()

  Province/State Country/Region      Lat     Long  confirm  recover  death
0            NaN    Afghanistan  33.0000  65.0000     7653    850.0    178
1            NaN        Albania  41.1533  20.1683      949    742.0     31
2            NaN        Algeria  28.0339   1.6596     7377   3746.0    561
3            NaN        Andorra  42.5063   1.5218      761    628.0     51
4            NaN         Angola -11.2027  17.8739       52     17.0      3

In [21]:
data.isna().sum()

Province/State    185
Country/Region      0
Lat                 0
Long                0
confirm             0
recover            17
death               0
dtype: int64

In [22]:
data['recover'].fillna(0, inplace=True)

In [23]:
data['Province/State'].fillna('', inplace=True)

In [24]:
data['recover']=data['recover'].astype('int')

In [25]:
data.isna().sum()

Province/State    0
Country/Region    0
Lat               0
Long              0
confirm           0
recover           0
death             0
dtype: int64

In [26]:
data.columns = ['state','country','lat','long','confirm','recover','death']

In [27]:
data.head()

  state      country      lat     long  confirm  recover  death
0        Afghanistan  33.0000  65.0000     7653      850    178
1            Albania  41.1533  20.1683      949      742     31
2            Algeria  28.0339   1.6596     7377     3746    561
3            Andorra  42.5063   1.5218      761      628     51
4             Angola -11.2027  17.8739       52       17      3

In [28]:
data.to_json('../frontend/src/assets/data/data.json', orient='records' )